
#include <HanumanMini.h>
#include <HanumanMiniFastLine16CH.h>

void setup() {
  Serial.begin(115200);
  Beep(100);
  delay(50);
  Beep(100);
  pinMode(signal_pin, INPUT);
  _setting();


  Mode();
  delay(100);  // หน่วงเวลา 0.1 วินาที
  Beep(200);   // ใช้ buzzer เป็นเวลา 0.2 วินาที
  // TestMotor();
  //FinishWaitOK();
  // คำสั่งเจอแยก >> 'l'=เลี้ยวซ้าย ,'r'=เลี้ยวขวา ,'p'=ตรง ,'s'=หยุด
  // PID จนกว่าจะเจอแยก TrackCross(Speed, Kp , Kd , 'คำสั่งเจอแยก')
  // KP -> ค่าเข้าโค้ง ยิ่งเพิ่มยิ่งเข้าโค้งไว (0.01 - 0.025)
  // KD -> ค่าทำให้หุ่นนิ่ง ยิ่งเพิ่มยิ่งนิ่ง (0.08 - 0.5)
  // TrackCrossL(40, 10, 80, 'r');  // ใช้เซนเซอร์คู่ซ้ายในการนับแยก
  // TrackCrossR(100, 20, 20 ,'r');  // ใช้เซนเซอร์คู่ขวาในการนับแยก
  // TrackCrossC(40, 10, 80, 'r');  // ใช้เซนเซอร์คู่กลางในการนับแยก
  // TrackTime(100, 30, 30, 1500);
  // PID ด้วยเวลา TrackTime(Speed, Kp , Kd, เวลา); >> เวลา 1000 = 1 วินาที

  // Move(30,-30,2000);
  //คำสั่งเคลื่อนที่ Move(SpeedLeft,SpeedRight,TimeDelay);

  //__________________________________วางโค้ดใหม่หลังจากนี้บรรทัดนี้ทั้งหมด______________________________________________________________________

  Mission();



  //____________________________________ห้ามวางโค้ดหลังจากบรรทัดนี้____________________________________________________________________________
}

void loop() {
  MotorStop();
  delay(50);
}
