void Mission() {

  // ModeSpdPID(0, 100, -25);   //สูตรที่คิดค้นขึ้นเอง
  // ModeSpdPID(1, 100, -100);  //โหมดปกติทั้วไป(โหมด PID , ความเร็วสูงสุด, ความเร็วต่ำสุด)
  // ModeSpdPID(2, 100, -100);  //โหมดโค้งเยอะๆ จะวิ่งช้า(โหมด PID , ความเร็วสูงสุด, ความเร็วต่ำสุด)
  ModeSpdPID(3, 100, -100);  //สูตรที่คิดค้นขึ้นเอง
  // ModeSpdPID(4, 100, 0);     //โหมดปกติทั้วไป

  TrackLineColor(1);  // สีของเส้น 1 = ขาว , 0 = ดำ
  Dottedline(0);      //ไม่มีเส้นประใส่ 0  >> มีเส้นประใส่ 1
  RefLineValue(400);  // ค่าในการจับเส้น เซนเซอร์หน้า
                      //
  // TrackCrossC(20, 14, 14, 'r');  // ใช้เซนเซอร์คู่กลางในการนับแยก

  TrackTimeForLineFast(1, 14, 50, 25, 25, 1000);
}