void Mission() {
  // เลือกโหมดจำกัดความเร็วของ PID ModeSpdPID(โหมด, ความเร็วสูงสุด, ความเร็วต่ำสุด);
  // ModeSpdPID(0, 100, -25);   // ติดลบเมื่อไหร่ใช้ความเร็วต่ำสุด
  // ModeSpdPID(1, 100, -100);  // โหมดปกติทั่วไป
  // ModeSpdPID(2, 100, -100);  // โหมดโค้งเยอะ ๆ จะวิ่งช้า
  ModeSpdPID(3, 100, -100);     // ติดลบเมื่อไหร่ถอยด้วยความเร็ว BaseSpeed
  // ModeSpdPID(4, 100, 0);     // ไม่ให้ล้อหมุนถอยหลัง

  TrackLineColor(1);   // สีของเส้น 1 = ขาว, 0 = ดำ
  Dottedline(0);       // ไม่มีเส้นประใส่ 0 >> มีเส้นประใส่ 1
  RefLineValue(400);   // ค่าในการจับเส้น เซนเซอร์หน้า (0-1000)

  // TrackCrossC(20, 14, 14, 'r');  // ใช้เซนเซอร์คู่กลางในการนับแยก

  // TrackTimeForLineFast(ช่องเริ่ม, ช่องสุดท้าย, Speed, Kp, Kd, เวลา);
  TrackTimeForLineFast(1, 14, 50, 25, 25, 1000);
}
