void Mission_RoboTracer(int Menu) {

  // ModeSpdPID(0, 100, -25);   //สูตรที่คิดค้นขึ้นเอง
   ModeSpdPID(1, 100, -100);  //โหมดปกติทั้วไป(โหมด PID , ความเร็วสูงสุด, ความเร็วต่ำสุด)
  // ModeSpdPID(2, 100, -100);  //โหมดโค้งเยอะๆ จะวิ่งช้า(โหมด PID , ความเร็วสูงสุด, ความเร็วต่ำสุด)
  // ModeSpdPID(3, 100, -100);  //สูตรที่คิดค้นขึ้นเอง
  // ModeSpdPID(4, 100, 0);     //โหมดปกติทั้วไป

  TrackLineColor(1);  // สีของเส้น 1 = ขาว , 0 = ดำ
  Dottedline(0);      //ไม่มีเส้นประใส่ 0  >> มีเส้นประใส่ 1
  RefLineValue(500);  // ค่าในการจับเส้น เซนเซอร์หน้า

  TrackLineColorC(1);  // สีของเส้น เซนเซอร์ C (Mark) 1 = ขาว , 0 = ดำ
  RefLineValueC(500);  // ค่าในการจับ Mark เซนเซอร์ C

  // TrackMarker(ช่องเริ่ม, ช่องสุดท้าย, ความเร็วปกติ, ความเร็วทางโค้ง, Kp, Kd, จำนวน Mark ขวา, เวลาวิ่งต่อก่อนหยุด);
  switch (Menu) {
    case 1:  // กด 1 ครั้ง
      TrackMarker(0, 15, 60, 30, 0.025, 0.25, 2, 300);
      break;
    case 2:  // กด 2 ครั้ง
      TrackMarker(0, 15, 60, 40, 0.025, 0.25, 2, 300);
      break;
    case 3:  // กด 3 ครั้ง
      TrackMarker(0, 15, 70, 50, 0.025, 0.25, 2, 300);
      break;
    case 4:  // กด 4 ครั้ง
      TrackMarker(0, 15, 60, 30, 0.025, 0.25, 2, 300);
      break;
    case 5:  // กด 5 ครั้ง
      TrackMarker(0, 15, 60, 30, 0.025, 0.25, 2, 300);
      break;
    case 6:  // กด 6 ครั้ง
      TrackMarker(0, 15, 60, 30, 0.025, 0.25, 2, 300);
      break;
    case 7:  // กด 7 ครั้ง
      TrackMarker(0, 15, 60, 30, 0.025, 0.25, 2, 300);
      break;
    case 8:  // กด 8 ครั้ง
      TrackMarker(0, 15, 60, 30, 0.025, 0.25, 2, 300);
      break;
    case 9:  // กด 9 ครั้ง
      TrackMarker(0, 15, 60, 30, 0.025, 0.25, 2, 300);
      break;
    case 10:  // กด 10 ครั้ง
      TrackMarker(0, 15, 60, 30, 0.025, 0.25, 2, 300);
      break;
  }
}